NextFOAM-2602/tutorials/heatTransfer/buoyantSimpleFoam/hotRadiationRoom/0.orig/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            MarshakRadiation;
        value           uniform 0;
    }

    fixedWalls
    {
        type            MarshakRadiation;
        value           uniform 0;
    }

    ceiling
    {
        type            MarshakRadiation;
        value           uniform 0;
    }

    box
    {
        type            MarshakRadiation;
        value           uniform 0;
    }
}


// ************************************************************************* //
